# TODO: создать класс keyboards, который при необходимости будет расширяться.
# TODO: создать умный класс хендлер, который в зависимости от контекста принимает то или иное состояние.
# TODO: исследовать как работает метод __dell__ для хендлеров.
# как создавать классы при помощи type. с помощью type можно задать методы и атрибуты.
# пакет NLTK - почитать! Умеет определять синонимы, фильтровать мусор. Найти алгоритмы, чтобы применить в своем проекте.
# TODO: начать игру и сделать лайтовый цикл игры. Подумать насчет клавы свободных ходов.
# TODO: рисовать доску с помощью HTML текста
